# ElementsMatchReferenceCategory Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationOptions..::..ElementsMatchReferenceCategory Method
MultiReferenceAnnotationOptions Class See Also
---
Verifies that all of the elements match the reference category required by the MultiReferenceAnnotationType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ElementsMatchReferenceCategory(
	ICollection<ElementId> elements
)
```

Visual Basic
---
```text
Public Function ElementsMatchReferenceCategory ( _
	elements As ICollection(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
bool ElementsMatchReferenceCategory(
	ICollection<ElementId^>^ elements
)
```

# ### Parameters
elements
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The elements to test.
# ### Return Value
True if all the elements match the reference category required by the MultiReferenceAnnotationType.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace